micropython/micropython/ports/mimxrt/machine_can.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2023 Kwabena W. Agyeman
 * Copyright (c) 2026 Robert Hammelrath
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "py/obj.h"
#include "py/objarray.h"
#include "py/gc.h"
#include "py/binary.h"
#include "py/stream.h"
#include "py/mperrno.h"
#include "py/mphal.h"
#include "shared/runtime/mpirq.h"
#include "modmachine.h"
#include CLOCK_CONFIG_H

#include "fsl_iomuxc.h"
#include "fsl_flexcan.h"

#define CAN_MAX_DATA_FRAME              (8)

#define CAN_NORMAL_MODE                 (0)
#define CAN_LOOPBACK_FLAG               (1)
#define CAN_SILENT_FLAG                 (2)

#define CAN_PORT_PRINT_FUNCTION         (0)

// Port-specific IRQ flags
#define MP_CAN_IRQ_RX_OVERFLOW      (1 << 4)
#define MP_CAN_IRQ_RX_WARNING       (1 << 5)

#if MICROPY_HW_ENABLE_FDCAN
#define CAN_BRP_MIN 1
#define CAN_BRP_MAX 255
#define CAN_FD_BRS_BRP_MIN 1
#define CAN_FD_BRS_BRP_MAX 32

#else // Classic bxCAN
#define CAN_BRP_MIN 1
#define CAN_BRP_MAX (CAN_CTRL1_PRESDIV_MASK >> CAN_CTRL1_PRESDIV_SHIFT)
#endif

#define CAN_PROPSEG_MAX (CAN_CTRL1_PROPSEG_MASK >> CAN_CTRL1_PROPSEG_SHIFT)
#define CAN_PSEG1_MAX (CAN_CTRL1_PSEG1_MASK >> CAN_CTRL1_PSEG1_SHIFT)
#define CAN_PSEG2_MAX (CAN_CTRL1_PSEG2_MASK >> CAN_CTRL1_PSEG2_SHIFT)

#define CAN_TSEG1_MIN 2
#define CAN_TSEG1_MAX (CAN_PROPSEG_MAX + CAN_PSEG1_MAX + 2)
#define CAN_TSEG2_MIN 1
#define CAN_TSEG2_MAX (CAN_PSEG2_MAX + 1)
#define CAN_SJW_MIN 1
#define CAN_SJW_MAX ((CAN_CTRL1_RJW_MASK >> CAN_CTRL1_RJW_SHIFT) + 1)
#define CAN_USE_UPSTREAM_TIMING  (1)

#define CAN_HW_MAX_FILTER (((CAN_CTRL2_RFFN_MASK >> CAN_CTRL2_RFFN_SHIFT) + 1) * 8)
#define CAN_FILTER_MASK_NUM             (64)
#if ((defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641) || \
    (defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_5829) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_5829))
#define CAN_TX_QUEUE_LEN                (64 - 7 - (CAN_HW_MAX_FILTER / 4))
#else
#define CAN_TX_QUEUE_LEN                (64 - 6 - (CAN_HW_MAX_FILTER / 4))
#endif

// matches fsl_flexcan.c enum _flexcan_mb_code_tx
#define kFLEXCAN_TxMbInactive           (0x8)
#define kFLEXCAN_TxMbAbort              (0x9)
#define kFLEXCAN_TxMbDataOrRemote       (0xC)
#define kFLEXCAN_TxMbTanswer            (0xE)
#define kFLEXCAN_TxMbNotUsed            (0xF)

enum {
    CAN_STATE_STOPPED,
    CAN_STATE_ERROR_ACTIVE,
    CAN_STATE_ERROR_WARNING,
    CAN_STATE_ERROR_PASSIVE,
    CAN_STATE_BUS_OFF,
};

#define MICROPY_HW_CAN_NUM MP_ARRAY_SIZE(can_index_table)

#define CTX (iomux_table[index])
#define CRX (iomux_table[index + 1])

typedef struct machine_can_port {
    uint8_t can_hw_id;
    CAN_Type *can_inst;
    flexcan_config_t *flexcan_config;
    flexcan_rx_fifo_config_t *flexcan_rx_fifo_config;
    uint8_t flexcan_txmb_start;
    uint8_t flexcan_txmb_count;
    uint8_t flt_conf;
    machine_can_state_t can_state;
    bool irq_state_changed;
    bool is_enabled;
    uint16_t num_error_warning;
    uint16_t num_error_passive;
    uint16_t num_bus_off;
    uint16_t num_rx_overrun;
} machine_can_port_t;

typedef struct _iomux_table_t {
    uint32_t muxRegister;
    uint32_t muxMode;
    uint32_t inputRegister;
    uint32_t inputDaisy;
    uint32_t configRegister;
} iomux_table_t;

static const uint8_t can_index_table[] = MICROPY_HW_CAN_INDEX;
#ifdef MIMXRT117x_SERIES
static const uint32_t can_clock_index_table[] = {
    BOARD_BOOTCLOCKRUN_CAN1_CLK_ROOT,
    BOARD_BOOTCLOCKRUN_CAN2_CLK_ROOT,
    BOARD_BOOTCLOCKRUN_CAN3_CLK_ROOT
};
#endif
static CAN_Type *can_base_ptr_table[] = CAN_BASE_PTRS;
static const iomux_table_t iomux_table[] = {
    IOMUX_TABLE_CAN
};

bool can_set_iomux(int8_t can) {
    int index = (can - 1) * 2;

    if (CTX.muxRegister != 0) {
        IOMUXC_SetPinMux(CTX.muxRegister, CTX.muxMode, CTX.inputRegister, CTX.inputDaisy, CTX.configRegister, 0U);
        IOMUXC_SetPinConfig(CTX.muxRegister, CTX.muxMode, CTX.inputRegister, CTX.inputDaisy, CTX.configRegister,
            pin_generate_config(PIN_PULL_UP_100K, PIN_MODE_OUT, PIN_DRIVE_6, CTX.configRegister));

        IOMUXC_SetPinMux(CRX.muxRegister, CRX.muxMode, CRX.inputRegister, CRX.inputDaisy, CRX.configRegister, 0U);
        IOMUXC_SetPinConfig(CRX.muxRegister, CRX.muxMode, CRX.inputRegister, CRX.inputDaisy, CRX.configRegister,
            pin_generate_config(PIN_PULL_UP_100K, PIN_MODE_IN, PIN_DRIVE_6, CRX.configRegister));

        return true;
    } else {
        return false;
    }
}

void machine_can_handler(CAN_Type *base) {
    machine_can_obj_t *self = NULL;
    for (int i = 0; i < MICROPY_HW_NUM_CAN_IRQS; ++i) {
        machine_can_obj_t *machine_can_obj = MP_STATE_PORT(machine_can_objs[i]);
        if ((machine_can_obj != NULL) && (machine_can_obj->port->can_inst == base)) {
            self = machine_can_obj;
            break;
        }
    }
    if (self != NULL) {
        struct machine_can_port *port = self->port;
        // Check the generic IRQ flags and changes to the bus state.
        // Since the latter does not raise an interrupt for all
        // transitions, it requires a different event.
        mp_int_t irq_flags = 0;
        uint32_t result = FLEXCAN_GetStatusFlags(port->can_inst);
        uint32_t flt_conf = (result & CAN_ESR1_FLTCONF_MASK) >> CAN_ESR1_FLTCONF_SHIFT;
        machine_can_state_t state = port->can_state;
        // check if flt_conf was changed
        // If yes, wave the flag & change the state
        if (flt_conf != port->flt_conf) {
            // Most common case first
            if (flt_conf == 0) {
                if ((result & CAN_ESR1_RXWRN_MASK) || (result & CAN_ESR1_TXWRN_MASK)) {
                    port->can_state = MP_CAN_STATE_WARNING;
                } else {
                    port->can_state = MP_CAN_STATE_ACTIVE;
                }
            } else if (flt_conf == 1) {
                if (port->can_state == MP_CAN_STATE_WARNING) {
                    ++port->num_error_passive;
                }
                port->can_state = MP_CAN_STATE_PASSIVE;
            } else {
                if (port->can_state == MP_CAN_STATE_PASSIVE) {
                    ++port->num_bus_off;
                }
                port->can_state = MP_CAN_STATE_BUS_OFF;
            }
            port->flt_conf = flt_conf;
        }
        if (result & (CAN_ESR1_RWRNINT_MASK | CAN_ESR1_TWRNINT_MASK)) {
            if (port->can_state == MP_CAN_STATE_ACTIVE) {
                ++port->num_error_warning;
            }
            port->can_state = MP_CAN_STATE_WARNING;
        }
        // If the bus state got more severe, raise an interrupt.
        // Since the state values are ordered among severity, a simple
        // compare is sufficient.
        if (port->can_state > state) {
            irq_flags |= MP_CAN_IRQ_STATE;
            port->irq_state_changed = true;
        }
        FLEXCAN_ClearStatusFlags(port->can_inst, FLEXCAN_ERROR_AND_STATUS_INIT_FLAG);

        uint64_t mb_status_flags = FLEXCAN_GetMbStatusFlags(port->can_inst, 0xffffffffffffffff);

        // Check the FIFO interrupt flags
        if (mb_status_flags & (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag) {
            irq_flags |= MP_CAN_IRQ_RX;
            // Disable RX interrupts to avoid IRQ loops. It will be re-enabled by
            // receive or setting the trigger.The Overflow-Interrupt is handled here and is kept.
            FLEXCAN_DisableMbInterrupts(port->can_inst, kFLEXCAN_RxFifoFrameAvlFlag);
        }
        if (mb_status_flags & (uint32_t)kFLEXCAN_RxFifoOverflowFlag) {
            ++port->num_rx_overrun;
            FLEXCAN_ClearMbStatusFlags(port->can_inst, kFLEXCAN_RxFifoOverflowFlag);
        }
        // Check the TX MB interrupt flags.
        uint64_t irq_tx_mask = ~((1ULL << port->flexcan_txmb_start) - 1);
        if (mb_status_flags & irq_tx_mask) {
            // Disable the interrupt and keep the flags for reporting.
            // It will be re-enabled by sending a frame.
            FLEXCAN_DisableMbInterrupts(port->can_inst, mb_status_flags & irq_tx_mask);
            irq_flags |= MP_CAN_IRQ_TX;
        }

        if (irq_flags & self->mp_irq_trigger) {
            mp_irq_handler(self->mp_irq_obj);
        }
    }
}

#if defined(CAN1)
void CAN1_IRQHandler(void) {
    machine_can_handler(CAN1);
}
#endif

