micropython/micropython/ports/mimxrt/machine_can.c
static mp_uint_t machine_can_port_max_data_len(mp_uint_t flags) {
    #if MICROPY_HW_ENABLE_FDCAN
    if (flags & CAN_MSG_FLAG_FD_F) {
        return 64;
    }
    #endif
    return 8;
}

// Clear all filters
static void machine_can_port_clear_filters(machine_can_obj_t *self) {
    struct machine_can_port *port = self->port;

    // Clear the filters
    memset(port->flexcan_rx_fifo_config->idFilterTable, 0,
        sizeof(uint32_t) * port->flexcan_rx_fifo_config->idFilterNum);
    FLEXCAN_SetRxFifoConfig(port->can_inst, port->flexcan_rx_fifo_config, true);
    // Clear the masks. Kind of obsolete, since the mask is always
    // set with the filter.
    FLEXCAN_EnterFreezeMode(port->can_inst);
    for (int idx = 0; idx < CAN_FILTER_MASK_NUM; idx++) {
        port->can_inst->RXIMR[idx] = 0x3fffffff;
    }
    FLEXCAN_ExitFreezeMode(port->can_inst);
}

// The extmod layer calls this function in a loop with incrementing filter_idx
// values. It's up to the port how to apply the filters from here, and to raise
// an exception if there are too many.

static void machine_can_port_set_filter(machine_can_obj_t *self, int filter_idx, mp_uint_t can_id, mp_uint_t mask, mp_uint_t flags) {
    struct machine_can_port *port = self->port;

    if (filter_idx >= port->flexcan_rx_fifo_config->idFilterNum) {
        return;
    }
    if (flags & CAN_MSG_FLAG_EXT_ID) {
        can_id = FLEXCAN_ID_EXT(can_id) | (1 << 29);
        mask = FLEXCAN_ID_EXT(mask) | (1 << 29);
    } else {
        can_id = FLEXCAN_ID_STD(can_id);
        mask = FLEXCAN_ID_STD(mask);
    }
    if (flags & CAN_MSG_FLAG_RTR) {
        can_id |= 1 << 30;
        mask |= 1 << 30;
    }
    port->flexcan_rx_fifo_config->idFilterTable[filter_idx] = can_id << 1;
    if (filter_idx < CAN_FILTER_MASK_NUM) {
        FLEXCAN_SetRxIndividualMask(port->can_inst, filter_idx, mask << 1);
    }
    // t.b.d.: Set a single filter instead of reloading all filters of the table
    // multiple times.
    FLEXCAN_SetRxFifoConfig(port->can_inst, port->flexcan_rx_fifo_config, true);
}

// Update interrupt configuration based on the new contents of 'self'
static void machine_can_update_irqs(machine_can_obj_t *self) {
    struct machine_can_port *port = self->port;
    uint16_t triggers = self->mp_irq_trigger;
    uint64_t irq_flags = 0;
    uint64_t irq_tx_mask = ~((1ULL << port->flexcan_txmb_start) - 1);
    if (triggers & MP_CAN_IRQ_RX) {
        irq_flags |= kFLEXCAN_RxFifoFrameAvlFlag;
    }
    // Clear all pending MB interrupt flags
    FLEXCAN_ClearMbStatusFlags(port->can_inst,
        irq_tx_mask | (kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag));
    // disable all MB interrupts
    FLEXCAN_DisableMbInterrupts(port->can_inst,
        irq_tx_mask | (kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag));
    // enable the MB RX Interrupts, if enabled. TX interrupts will be enabled when sending
    if (self->mp_irq_obj->handler != mp_const_none) {
        FLEXCAN_EnableMbInterrupts(port->can_inst, kFLEXCAN_RxFifoFrameAvlFlag);
    }
}

// Return the irq().flags() result as registered by the handler.
static mp_uint_t machine_can_port_irq_flags(machine_can_obj_t *self) {
    struct machine_can_port *port = self->port;
    mp_int_t irq_flags = 0;
    uint64_t mb_status_flags = FLEXCAN_GetMbStatusFlags(port->can_inst, 0xffffffffffffffff);

    if ((uint32_t)mb_status_flags & kFLEXCAN_RxFifoFrameAvlFlag) {
        irq_flags |= MP_CAN_IRQ_RX;
    }
    uint64_t irq_tx_mask = 1ULL << port->flexcan_txmb_start;
    for (mp_uint_t i = 0; i < port->flexcan_txmb_count; i++) {
        if (mb_status_flags & irq_tx_mask) {
            irq_flags |= (MP_CAN_IRQ_TX | (i << MP_CAN_IRQ_IDX_SHIFT));
            FLEXCAN_ClearMbStatusFlags(port->can_inst, irq_tx_mask);
            FLEXCAN_EnableMbInterrupts(port->can_inst, irq_tx_mask);
            break;
        }
        irq_tx_mask <<= 1;
    }
    if (port->irq_state_changed) {
        port->irq_state_changed = false;
        irq_flags |= MP_CAN_IRQ_STATE;
    }
    return irq_flags;
}

#define IS_MATCHING_ID_TYPE(i, cs) (((frame->format == kFLEXCAN_FrameFormatStandard) || (cs & CAN_CS_IDE_MASK)) \
    && ((frame->type == kFLEXCAN_FrameTypeData) || (cs & CAN_CS_RTR_MASK)) \
    && (port->can_inst->MB[i].ID == frame->id))
#define IS_TX_PENDING(cs) ((cs & CAN_CS_CODE_MASK) == CAN_CS_CODE(kFLEXCAN_TxMbDataOrRemote))

static mp_uint_t can_find_txmb(machine_can_obj_t *self, flexcan_frame_t *frame, mp_uint_t flags) {
    struct machine_can_port *port = self->port;

    // See if this frame id has been used before. If so, reuse the same mailbox to keep message ordering.
    for (mp_uint_t i = port->flexcan_txmb_start; i < (port->flexcan_txmb_count + port->flexcan_txmb_start); i++) {
        uint32_t cs_temp = port->can_inst->MB[i].CS;
        if (IS_MATCHING_ID_TYPE(i, cs_temp)) {
            if (!IS_TX_PENDING(cs_temp)) {
                return i;
            } else {
                // Matching ID, but MB is still busy
                if (flags & CAN_MSG_FLAG_UNORDERED) {
                    // Allow to select a different Frame ID.
                    break;
                } else {
                    return 0;
                }
            }
        }
    }
    // The frame id has never been used before or CAN_MSG_FLAG_UNORDERED is set.
    // Pick the first available mailbox.
    for (mp_uint_t i = port->flexcan_txmb_start; i < (port->flexcan_txmb_count + port->flexcan_txmb_start); i++) {
        uint32_t cs_temp = port->can_inst->MB[i].CS;
        if (!IS_TX_PENDING(cs_temp)) {
            return i;
        }
    }
    return 0;
}


static mp_int_t machine_can_port_send(machine_can_obj_t *self, mp_uint_t id, const byte *data, size_t data_len, mp_uint_t flags) {
    struct machine_can_port *port = self->port;
    flexcan_frame_t tx_msg;

    tx_msg.dataWord0 = 0;
    tx_msg.dataWord1 = 0;

    // The readable size of data is guaranteed to be data_len.
    // So it has to be considered during transfer.
    if (data_len > 0) {
        tx_msg.dataByte0 = data[0];
    }
    if (data_len > 1) {
        tx_msg.dataByte1 = data[1];
    }
    if (data_len > 2) {
        tx_msg.dataByte2 = data[2];
    }
    if (data_len > 3) {
        tx_msg.dataByte3 = data[3];
    }
    if (data_len > 4) {
        tx_msg.dataByte4 = data[4];
    }
    if (data_len > 5) {
        tx_msg.dataByte5 = data[5];
    }
    if (data_len > 6) {
        tx_msg.dataByte6 = data[6];
    }
    if (data_len > 7) {
        tx_msg.dataByte7 = data[7];
    }
    tx_msg.length = data_len;
    tx_msg.type = (flags & CAN_MSG_FLAG_RTR) != 0;
    tx_msg.format = (flags & CAN_MSG_FLAG_EXT_ID) != 0;
    tx_msg.id = tx_msg.format ? FLEXCAN_ID_EXT(id) : FLEXCAN_ID_STD(id);

    mp_uint_t mbIdx = can_find_txmb(self, &tx_msg, flags);
    if (mbIdx && (FLEXCAN_WriteTxMb(port->can_inst, mbIdx, &tx_msg) == kStatus_Success)) {
        uint64_t irq_tx_mask = 1ULL << mbIdx;
        FLEXCAN_ClearMbStatusFlags(port->can_inst, irq_tx_mask);
        // Enable TX interrupts if needed.
        if (self->mp_irq_trigger & MP_CAN_IRQ_TX) {
            FLEXCAN_EnableMbInterrupts(port->can_inst, irq_tx_mask);
        }
        return mbIdx - port->flexcan_txmb_start;
    } else {
        return -1;
    }
}

static bool machine_can_port_cancel_send(machine_can_obj_t *self, mp_uint_t idx) {
    struct machine_can_port *port = self->port;

    if (idx >= port->flexcan_txmb_count) {
        return false;
    }
    uint64_t flag_mask = 1ull << (idx + port->flexcan_txmb_start);
    // Procedure according to RM "40.7.7.1 Transmission Abort Mechanism".
    // 1. Arm checks the corresponding IFLAG and clears it, if asserted.
    if (FLEXCAN_GetMbStatusFlags(port->can_inst, flag_mask)) {
        FLEXCAN_ClearMbStatusFlags(port->can_inst, flag_mask);
    }
    // 2. Arm writes 0b1001 into the CODE field of the C/S word.
    uint32_t cs_temp = port->can_inst->MB[idx + port->flexcan_txmb_start].CS;
    uint32_t cs_start = cs_temp & CAN_CS_CODE_MASK;
    cs_temp = (cs_temp & ~CAN_CS_CODE_MASK) | CAN_CS_CODE(kFLEXCAN_TxMbAbort);
    port->can_inst->MB[idx + port->flexcan_txmb_start].CS = cs_temp;
    // 3. Arm waits for the corresponding IFLAG indicating that the frame was either transmitted or aborted.
    //    Omitted because the flag is never set.
    // 4. Arm reads the CODE field to check if the frame was either transmitted (CODE=0b1000) or aborted (CODE=0b1001).
    mp_int_t can_cs_code = (port->can_inst->MB[idx + port->flexcan_txmb_start].CS & CAN_CS_CODE_MASK);
    // Clear the MB to the initial state.
    port->can_inst->MB[idx + port->flexcan_txmb_start].CS = CAN_CS_CODE(kFLEXCAN_TxMbInactive);
    // 5. It is necessary to clear the corresponding IFLAG in order to allow the MB to be reconfigured.
    //    Seems obsolete, if it was never set. No code is generated by the compiler.
    FLEXCAN_ClearMbStatusFlags(port->can_inst, flag_mask);
    // Return True if at the beginning the MB was in use.
    return (cs_start == CAN_CS_CODE(kFLEXCAN_TxMbDataOrRemote)) && (cs_start != can_cs_code);
}

static bool machine_can_port_recv(machine_can_obj_t *self, void *data, size_t *dlen, mp_uint_t *id, mp_uint_t *flags, mp_uint_t *errors) {
    struct machine_can_port *port = self->port;

    uint32_t mb_status_flags = FLEXCAN_GetMbStatusFlags(port->can_inst,
        kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag);

    mp_int_t err_fifo = 0;
    if ((mb_status_flags & kFLEXCAN_RxFifoOverflowFlag)) {
        err_fifo |= CAN_RECV_ERR_OVERRUN;
    }
    if ((mb_status_flags & kFLEXCAN_RxFifoWarningFlag)) {
        err_fifo |= CAN_RECV_ERR_FULL;
    }
    *errors = err_fifo;

    if (!(mb_status_flags & kFLEXCAN_RxFifoFrameAvlFlag)) {
        return false;
    }
    flexcan_frame_t rx_frame;
    status_t status = FLEXCAN_ReadRxFifo(port->can_inst, &rx_frame);

