micropython/micropython/ports/mimxrt/machine_can.c
    FLEXCAN_ClearMbStatusFlags(port->can_inst, kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag);
    FLEXCAN_EnableMbInterrupts(port->can_inst, kFLEXCAN_RxFifoFrameAvlFlag);

    if (status != kStatus_Success) {
        return false;
    }
    uint8_t *rx_data = (uint8_t *)data;
    // rx_data is guaranteed to have a size of 8 bytes at least.
    // So this amount can be copied regardless of the actual frame length.
    rx_data[0] = rx_frame.dataByte0;
    rx_data[1] = rx_frame.dataByte1;
    rx_data[2] = rx_frame.dataByte2;
    rx_data[3] = rx_frame.dataByte3;
    rx_data[4] = rx_frame.dataByte4;
    rx_data[5] = rx_frame.dataByte5;
    rx_data[6] = rx_frame.dataByte6;
    rx_data[7] = rx_frame.dataByte7;
    *dlen = rx_frame.length;
    *flags = (rx_frame.format ? CAN_MSG_FLAG_EXT_ID : 0) |
        (rx_frame.type ? CAN_MSG_FLAG_RTR : 0);
    *id = (rx_frame.id & 0x3fffffff) >> (rx_frame.format ? 0 : 18);

    return true;
}

static machine_can_state_t machine_can_port_get_state(machine_can_obj_t *self) {
    struct machine_can_port *port = self->port;
    machine_can_state_t state = MP_CAN_STATE_STOPPED;

    if (port->is_enabled) {
        uint32_t result = FLEXCAN_GetStatusFlags(port->can_inst);
        uint32_t flt_conf = (result & CAN_ESR1_FLTCONF_MASK) >> CAN_ESR1_FLTCONF_SHIFT;
        if (flt_conf > 1) {
            state = MP_CAN_STATE_BUS_OFF;
        } else if (flt_conf == 1) {
            state = MP_CAN_STATE_PASSIVE;
        } else {
            // The controller reports "state = Active", but
            // tec or rec are still >= 96; return MP_CAN_STATE_WARNING.
            if ((result & CAN_ESR1_RXWRN_MASK) || (result & CAN_ESR1_TXWRN_MASK)) {
                state = MP_CAN_STATE_WARNING;
            } else {
                state = MP_CAN_STATE_ACTIVE;
            }
        }
    }
    return state;
}

static void machine_can_port_restart(machine_can_obj_t *self) {

    struct machine_can_port *port = self->port;
    // Disable all FLEXCAN MB interrupts
    FLEXCAN_DisableMbInterrupts(port->can_inst, 0xffffffffffffffffull);
    // Cancel all pending TX MBs
    for (mp_uint_t idx = 0; idx < self->port->flexcan_txmb_count; idx++) {
        machine_can_port_cancel_send(self, idx);
    }
    // Clear counts
    port->num_error_warning = 0;
    port->num_error_passive = 0;
    port->num_bus_off = 0;
    port->num_rx_overrun = 0;
    port->can_state = machine_can_port_get_state(self);
    port->irq_state_changed = false;
    // Drain the FIFO
    flexcan_frame_t rx_frame;
    while (FLEXCAN_GetMbStatusFlags(port->can_inst, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag) != 0) {
        FLEXCAN_ReadRxFifo(port->can_inst, &rx_frame);
        FLEXCAN_ClearMbStatusFlags(port->can_inst,
            kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag);
    }
    // Clear all filters
    // machine_can_port_clear_filters(self);
    // Re-enable FLEXCAN MB receive interrupt
    FLEXCAN_EnableMbInterrupts(port->can_inst, kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoFrameAvlFlag);
    // Since Bit BOFF_REC of CTRL1 is 0, bus off recovery happens automatic.

    // // As an alternative approach call deinit() and init() to set up
    // // the CAN controller to a clean start state. That resets REC and TEC
    // // as well.
    // machine_can_port_deinit(self);
    // machine_can_port_init(self);

}

static mp_uint_t can_count_txmb_pending(machine_can_port_t *port) {
    mp_uint_t count = 0;
    for (mp_uint_t i = 0; i < port->flexcan_txmb_count; i++) {
        if (IS_TX_PENDING(port->can_inst->MB[port->flexcan_txmb_start + i].CS)) {
            count++;
        }
    }
    return count;
}

// Updates values in self->counters (which counters are updated by this function versus from ISRs and the like
// is port specific
static void machine_can_port_update_counters(machine_can_obj_t *self) {
    struct machine_can_port *port = self->port;
    machine_can_counters_t *counters = &self->counters;

    uint8_t tec;
    uint8_t rec;
    FLEXCAN_GetBusErrCount(port->can_inst, &tec, &rec);
    counters->tec = tec;
    counters->rec = rec;
    counters->num_warning = port->num_error_warning;
    counters->num_passive = port->num_error_passive;
    counters->num_bus_off = port->num_bus_off;
    counters->tx_pending = can_count_txmb_pending(port);
    counters->rx_pending = FLEXCAN_GetMbStatusFlags(port->can_inst, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag) != 0;
    counters->rx_overruns = port->num_rx_overrun;
}

// Hook for port to fill in the final item of the get_timings() result list with controller-specific values
static mp_obj_t machine_can_port_get_additional_timings(machine_can_obj_t *self, mp_obj_t optional_arg) {
    return mp_const_none;
}
